Reports/СтатистикаСезона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СтатистикаСезона</Name>
			<Comment>(объ)</Comment>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Тур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Тур</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Игры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СыграноИгр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Игры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хозяин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гость</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сыгран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/СтатистикаСезона/Forms/ФормаОтчета/Ext/Form/Module.bsl
// http://infostart.ru/public/78455/

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// реквизит отчета
	Сезон = Константы.ТекущийСезон.Получить();
	Обновить();

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Обновить()
	
КонецПроцедуры

&НаСервере
Процедура Обновить()


	Макет = Отчеты.СтатистикаСезона.ПолучитьМакет("Отчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИгрыОб.Тур КАК Тур,
	|	ИгрыОб.ВыигрОборот + ИгрыОб.НичьиОборот + ИгрыОб.ПоражОборот КАК ИгрСыграно,
	|	СУММА(ИгрыОб.ВыигрОборот) КАК Хозяева,
	|	СУММА(ИгрыОб.НичьиОборот) КАК Ничьи,
	|	СУММА(ИгрыОб.ПоражОборот) КАК Гости,
	|	ИгрыОб.МЗОборот + ИгрыОб.МПОборот КАК ВсегоМячи,
	|	СУММА(ИгрыОб.МЗОборот) КАК ХозяеваМячи,
	|	СУММА(ИгрыОб.МПОборот) КАК ГостиМячи,
	|	ИгрыОб.МЗОборот - ИгрыОб.МПОборот КАК Разница,
	|	(ИгрыОб.МЗОборот + ИгрыОб.МПОборот) / (ИгрыОб.ВыигрОборот + ИгрыОб.НичьиОборот + ИгрыОб.ПоражОборот) КАК СреднРезультативность
	|ИЗ
	|	РегистрНакопления.Игры.Обороты(
	|			,
	|			,
	|			,
	|			Сезон = &Сезон
	|				И ГдеИгра = 1) КАК ИгрыОб
	|
	|СГРУППИРОВАТЬ ПО
	|	ИгрыОб.Тур,
	|	ИгрыОб.МЗОборот - ИгрыОб.МПОборот,
	|	ИгрыОб.МЗОборот + ИгрыОб.МПОборот,
	|	(ИгрыОб.МЗОборот + ИгрыОб.МПОборот) / (ИгрыОб.ВыигрОборот + ИгрыОб.НичьиОборот + ИгрыОб.ПоражОборот),
	|	ИгрыОб.ВыигрОборот + ИгрыОб.НичьиОборот + ИгрыОб.ПоражОборот
	|
	|УПОРЯДОЧИТЬ ПО
	|	Тур УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(Тур),
	|	СУММА(ИгрСыграно),
	|	СУММА(Хозяева),
	|	СУММА(Ничьи),
	|	СУММА(Гости),
	|	СУММА(ВсегоМячи),
	|	СУММА(ХозяеваМячи),
	|	СУММА(ГостиМячи),
	|	СУММА(Разница),
	|	СУММА(СреднРезультативность)
	|ПО
	|	ОБЩИЕ";

	Запрос.УстановитьПараметр("Сезон", Сезон);

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	//ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.ФиксацияСверху = ТабДок.ВысотаТаблицы + 1;
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    ОбластьСрРезИтог	= ОбластьОбщийИтог.Область("СрРезИтог");
	ОбластьСрРез		= ОбластьДетальныхЗаписей.Область("СрРез");
	
	ЦветУр1	= WebЦвета.Красный;
	ЦветУр2	= WebЦвета.Зеленый;
	ЦветУр3	= Новый Цвет;	//WebЦвета.НавахоБелый;
	ЦветУр4	= WebЦвета.ТемноГрифельноСиний;
	
	Если ВыборкаОбщийИтог.Следующий() Тогда		// Общий итог
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ОбластьОбщийИтог.Параметры.СреднРезультативность = ВыборкаОбщийИтог.ВсегоМячи / ВыборкаОбщийИтог.ИгрСыграно;
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
	КонецЕсли;
	
	ВыборкаДетали = ВыборкаОбщийИтог.Выбрать();

	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		Разница = ВыборкаДетали.Разница;
		СрРез	= ВыборкаДетали.СреднРезультативность;
		ОбластьДетальныхЗаписей.Параметры.Разница = ?(Разница > 0, "+", "") + Разница;
		Если СрРез >=3 Тогда
		    ЦветУр = ЦветУр1
		ИначеЕсли СрРез >=2.5 Тогда
		    ЦветУр = ЦветУр2
		ИначеЕсли СрРез >=2 Тогда
		    ЦветУр = ЦветУр3
		Иначе
		    ЦветУр = ЦветУр4
		КонецЕсли;
		ОбластьСрРез.ЦветТекста = ЦветУр;
		
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры // Обновить()


&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ДокументСсылка = ПолучитьФормуДокументаНаСервере(Расшифровка, Сезон);
	
	Если Не ДокументСсылка = Неопределено Тогда
		Параметр = Новый Структура("Ключ", ДокументСсылка);
		Форма = ПолучитьФорму("Документ.Тур.ФормаОбъекта", Параметр, ЭтаФорма);
		Форма.Открыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФормуДокументаНаСервере(Тур, Сезон)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Тур.Ссылка
	               |ИЗ
	               |	Документ.Тур КАК Тур
	               |ГДЕ
	               |	Тур.Сезон = &Сезон
	               |	И Тур.Номер = &Тур";
	
	Запрос.УстановитьПараметр("Сезон", Сезон);
	Запрос.УстановитьПараметр("Тур", Строка(Тур));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка;
		Возврат Ссылка;
	КонецЕсли;
	
	Возврат Неопределено

КонецФункции

&НаКлиенте
Процедура СезонПриИзменении(Элемент)
	Обновить();
КонецПроцедуры
